// Напишите программу, которая на вход принимает одно число (N), 
// а на выходе показывает все целые числа в промежутке -N до N

int n = 5;
int a = -n;
while (a<n)
{
Console.WriteLine("a" + a);
a++;
}