// Напишите программу, которая на вход принимает число и выдает его квадрат (число усмноженное само на себя)
Console.WriteLine("Введите число: ");
int n = int.Parse(Console.ReadLine());


Console.WriteLine("Число: " + n);
Console.WriteLine("Квадрат: " + n * n);