// Напишите программу, которая на вход принимает два числа и проверяет, является ли первое число квадратом второго
int n = 25;
int a = 5;

Console.WriteLine(n + " первое число");
Console.WriteLine(a + " второе число");

if (a * a == n)
{
    Console.WriteLine("yes");
}
else 
{
   Console.WriteLine("no"); 
}